app/views/messages/_form.html.erb

        <tr>
          <td><%= User.find_by(id: message.from).name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]