app/views/users/show.html.erb

<ul>
  <% @user.interests.each do |interest| %>
---
SELECT "interests".* FROM "interests" WHERE "interests"."user_id" = ?  [["user_id", 1]]