app/controllers/interests_controller.rb

INSERT INTO "interests" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Teste"], ["user_id", 0], ["created_at", "2016-01-29 15:48:40.123483"], ["updated_at", "2016-01-29 15:48:40.123483"]]
---
  def create
    interest = Interest.new(interests_params)
    if interest.save!