app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."from" = ?  [["from", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."to" = ?  [["to", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @user = current_user
    @messages_from_user = Message.where(from: @user.id)
    @messages_to_user = Message.where(to: @user.id)

    @all_messages = []

    @messages_from_user.each do |message|
      @all_messages << message
    end

    @messages_to_user.each do |message|
      @all_messages << message
    end

    @conversations = []
    @all_messages.each do |message|
      @conversations << message.from if message.from != @user.id
      @conversations << message.to if message.to != @user.id
    end

    @conversations.uniq!.map!(){ |id| User.find(id) }

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."from" = 2 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."from" IN (1, 2) AND "messages"."to" IN (1, 2)
---
  def new
    @user = current_user
    @to_user = User.find(params[:to_id])
    @all_messages = Message.where(from: [@user.id, @to_user.id], to: [@user.id, @to_user.id])

INSERT INTO "messages" ("message", "from", "to", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "Teste Joao"], ["from", 1], ["to", 2], ["created_at", "2016-01-29 17:05:01.227074"], ["updated_at", "2016-01-29 17:05:01.227074"]]
---
  def create
    @message = Message.new(message_params)

    @message.save