app/controllers/punches_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT "punches".* FROM "punches" WHERE (user_punched = 4)
---
  def index
    @user = User.find(session[:user_id])
    @punches = Punch.where("user_punched = ?", @user.id )