app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "email@email.com"]]
---
  def login
    @user = User.find_by(email: params[:session][:email].downcase)